app/controllers/batch_controller.rb

SELECT "batches".* FROM "batches"
---
  def index
    @batches = Batch.all

SELECT "batches".* FROM "batches" WHERE "batches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @batch = Batch.find(params[:id])