app/controllers/list_controller.rb

  def set_list
    @list = List.find(params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]