app/controllers/product_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "store_products".* FROM "store_products" WHERE "store_products"."product_id" = $1 LIMIT $2  [["product_id", 1], ["LIMIT", 1]]
---
  def show
    @product = Product.find(params[:id])
    @storeproducts = StoreProduct.where(product: @product)