app/controllers/shoppinglist_controller.rb

  def index
    @shoppinglists = ShoppingList.all
---
SELECT "shopping_lists".* FROM "shopping_lists"