app/controllers/store_product_controller.rb

  def show
    @storeproduct = StoreProduct.find(params[:id])
---
SELECT "store_products".* FROM "store_products" WHERE "store_products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]